{
        "id": "5bdde9c2168777433cf348b3",
        "title": "How Do You Make Big Decisions You Won’t Regret Later",
        "subtitle": "Sadhguru answers a question on how we can figure out which direction we should invest our time and energies in life.",
        "photo": "https://quickseries-dev.s3.amazonaws.com/qsapi-files/files/d20a72a2-79f8-4d41-8ad1-7be9ac40ec56/cover.en.jpeg",
        "body": "<p><strong><em>Question:&nbsp;</em></strong><em>What should I consider before taking big decisions in life?</em></p><p><strong>Sadhguru</strong>: Essentially, what you are asking is what you should invest your life in. Do not think in terms of what job to take or what education to do. The important thing is this life. For everyone, their life is precious. Into what do you want to invest this precious life? If you look at it this way, you will find something truly worthwhile to do. If you think in terms of how to earn a living and how to get something, you will do something silly that you will regret for the rest of your life.&nbsp;</p><p>&nbsp;</p><p>Most people are a regret, which is why they are going around joylessly – they are not doing what they want to do. Instead of creating what really matters to them, they are doing something for a living. Every creature, worm, insect, bird and animal is earning their living. Earning a living is not a big deal for a human being. Unfortunately, because of ten to twenty generations of&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/video/solution-for-poverty\" target=\"_blank\">poverty in this country</a>, people have gotten into this mode. Parents are constantly grilling their children about how they will earn their living. When an earthworm can earn its living, is earning a living an issue for a human being with such a big brain?&nbsp;</p><p><br></p><p>The question is about what you are going to create because what you call as your life is just a certain amount of&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/article/life-death-time-energy-information\" target=\"_blank\">time and energy</a>. This energy that you call as your life, how are you going to invest it? If you are doing something truly worthwhile, it gets over before you know what happened. Only if you are doing something worthless, it feels like a long life. Have you noticed this? On a particular day when you were very happy, 24 hours went off like a moment. If you are miserable, 24 hours feels like ten years.&nbsp;</p><p class=\"ql-align-right\">If you are doing something truly worthwhile, it gets over before you know what happened. Only if you are doing something worthless, it feels like a long life.</p><p>One thing that every young person should do is, you must stay by yourself at least for two or three days without the influence of your peers, professors or parents and look at what you want to invest this&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/video/the-most-precious-gift\" target=\"_blank\">precious life</a>&nbsp;into. However big or small, it does not matter. If you see that something is truly worthwhile and you invest your life in that, this will be a life of fulfillment.</p><p><br></p><p>Editor's Note: The route to wellbeing doesn’t always seem clear cut to many people. What is the best course to take in your particular situation?&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/audio/deciding-what-to-do\" target=\"_blank\">Listen to this podcast</a>&nbsp;from Sadhguru and find out.</p><p><br></p>",
        "updated_at": "2018-11-03T18:32:34.813Z",
        "created_at": "2018-11-03T18:32:34.734Z"
    }
